package commands;

import managers.CollectionManager;

public class Help extends Command {
    public Help(CollectionManager collectionManager) {
        super("help", "вывести справку по доступным командам", collectionManager);
    }

    @Override
    public void run() {
        System.out.println(
            "help : вывести справку по доступным командам\n" + 
            "info : вывести в стандартный поток вывода информацию о коллекции (тип, дата инициализации, количество элементов и т.д.)\n" + 
            "show : вывести в стандартный поток вывода все элементы коллекции в строковом представлении\n" + 
            "add {element} : добавить новый элемент в коллекцию\n" + 
            "update id {element} : обновить значение элемента коллекции, id которого равен заданному\n" + 
            "remove_by_id id : удалить элемент из коллекции по его id\n" + 
            "clear : очистить коллекцию\n" + 
            "save : сохранить коллекцию в файл\n" + 
            "execute_script file_name : считать и исполнить скрипт из указанного файла. В скрипте содержатся команды в таком же виде, в котором их вводит пользователь в интерактивном режиме.\n" + 
            "exit : завершить программу (без сохранения в файл)\n" + 
            "head : вывести первый элемент коллекции\n" + 
            "add_if_max {element} : добавить новый элемент в коллекцию, если его значение превышает значение наибольшего элемента этой коллекции\n" + 
            "add_if_min {element} : добавить новый элемент в коллекцию, если его значение меньше, чем у наименьшего элемента этой коллекции\n" + 
            "count_less_than_description description : вывести количество элементов, значение поля description которых меньше заданного\n" +
            "filter_contains_name name : вывести элементы, значение поля name которых содержит заданную подстроку\n" +
            "filter_greater_than_genre genre : вывести элементы, значение поля genre которых больше заданного"
        );
    }
}
